In [2]:
# Import dependencies
import pandas as pd
import sqlite3

In [3]:
test_df = pd.read_csv("EURUSD_HistoricalPrices.csv")
test_df.head()

       Date    Open    High     Low   Close
0  01/01/25  1.0356  1.0364  1.0352  1.0359
1  12/31/24  1.0409  1.0426  1.0345  1.0355
2  12/30/24  1.0427  1.0459  1.0373  1.0408
3  12/27/24  1.0419  1.0446  1.0406  1.0428
4  12/26/24  1.0407  1.0432  1.0381  1.0425

In [4]:
cad_usd_df = pd.read_csv("../CAD_USD_Prices.csv")
cad_usd_df.head()

       Date    Open    High     Low   Close
0  01/01/25  1.4387  1.4407  1.4381  1.4392
1  12/31/24  1.4359  1.4412  1.4339  1.4385
2  12/30/24  1.4421  1.4432  1.4345  1.4357
3  12/27/24  1.4407  1.4450  1.4376  1.4413
4  12/26/24  1.4379  1.4423  1.4349  1.4408

In [5]:
jpy_usd_df = pd.read_csv("../JPY_USD_Prices.csv")
jpy_usd_df.head()

       Date    Open    High     Low   Close
0  01/01/25  157.21  157.44  157.19  157.40
1  12/31/24  156.84  157.55  156.03  157.21
2  12/30/24  157.87  158.08  156.67  156.84
3  12/27/24  158.00  158.00  157.35  157.84
4  12/26/24  157.19  158.09  157.08  158.00

In [7]:
conn = sqlite3.connect('test.sqlite')

In [8]:
test_df.to_sql('eur_usd', conn, if_exists='replace', index=False)
cad_usd_df.to_sql('cad_usd', conn, if_exists='replace', index=False)
jpy_usd_df.to_sql('jpy_usd', conn, if_exists='replace', index=False)

263

In [9]:
conn.close()